CSI API ETABS v1
cSapModel.TreeIsUpdateSuspended Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int TreeIsUpdateSuspended(
	ref bool IsSuspended
)
Function TreeIsUpdateSuspended (
	ByRef IsSuspended As Boolean
) As Integer
Dim instance As cSapModel
Dim IsSuspended As Boolean
Dim returnValue As Integer
returnValue = instance.TreeIsUpdateSuspended(IsSuspended)
int TreeIsUpdateSuspended(
	bool% IsSuspended
)
abstract TreeIsUpdateSuspended :
        IsSuspended : bool byref -> int
Parameters
IsSuspended
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cSapModel Interface
ETABSv1 Namespace